{
    "projects" : [

        {
            "title" : "Project: Project Site",
            "hash" : "site",
            "thumb" : "img/projects/project-site.jpg",
            "desc" : "Welcome! I built this site with nothing but my bare hands ( and by bare hands I mean a computer, a stack of reference books, and the internet ). These are personal projects I'm currently working on, they range from \"complete\" to \"still in the works\". Hopefully, within these pages you may learn something you didn't know, or find something that will save you precious time when you're approaching that dreaded deadline. Enjoy!",
            "url" : "#site",
            "tech" : "JavaScript, Less, jQuery, PreloadJS"
        },
        {
            "title" : "Project: Portfolio",
            "hash" : "porfolio",
            "thumb" : "img/projects/portfolio.jpg",
            "desc" : "My first attempt at a portfolio site built using HTML5 ( aka HTML, CSS, and JavaScript ). Coming from three and half years of working solely in ActionScript 3, it had been awhile since I worked outside of the Flash environment . Working with AS3, I became very well acquainted with Object Oriented Programming, and wished to carry over that knowledge to JS. For my first foray using OOP in JS, it turned out alright, however I think I used \"this\", one too many times. Green Sock had just released their Animation Platform in JS, I was already familiar with TweenLite/TweenMax, so it was a perfect choice for all the animations.",
            "url" : "http://spektraldevelopment.com/projects/portfolio/",
            "tech" : "JavaScript, GSAP"
        },
        {
            "title" : "Project: Spektraljs",
            "hash" : "spektraljs",
            "thumb" : "img/projects/spektraljs.jpg",
            "desc" : "Soon into my working with JS, I realized that I was amassing a collection of reusable code that I needed on a regular basis. At first I put them in their own separate JS file, but soon I wrapped an anonymous function around them and set out to create a library of my own. Now you might say \"Why would you do that when you can just use jQuery, Dojo, Moo Tools etc. ?\" I do use those libraries, and they're great, but I like to know my code inside and out.  Plus building a library is a great way to learn the ins and outs of JavaScript. Currently the project is in it's infancy, theirs no documentation yet and no minified version ( something I hope to address in the near future). You can check out my progress on GitHub or just click the \"GO\" button to have a look.",
            "url" : "http://github.com/spektraldevelopment/spektraljs",
            "tech" : "Javascript"
        },
        {
            "title" : "Project: The Randomizer",
            "hash" : "therandomizer",
            "thumb" : "img/projects/the-randomizer.jpg",
            "desc" : "I will attempt to port a Flash application I made a few years back into JS. The randomizer utilized the YouTube API. It basically takes any YouTube video and allows the user to loop and randomize the video resulting in some unintentional hilarious, albeit bizarre results. Hopefully the JS version of the YouTube API will be up to task performance wise. More to come...",
            "url" : "http://github.com/spektraldevelopment/therandomizer",
            "tech" : "JavaScript"
        }
   ]
}